git
curl
wget
zsh
vim
htop
jq
tmux
tree
trash-cli
eza
ripgrep
telnet
fzf
gh
iawscli
bash
cmake
pkg-config
pngquant
mysql-client
postgresql-client
python3-pip
python3-dev
yarn

