cask_args appdir: "/Applications"
brew 'git'
brew 'gh'

tap homebrew/cask-fonts
brew 'font-hackgen'
brew 'font-hackgen-nerd'

tap 'heroku/brew'
brew 'heroku'

brew 'awscli'

brew 'tree'
brew 'mackup'
brew 'pngquant'
brew 'eza'
brew 'trash'
brew 'vim'
brew 'tmux'
brew 'neofetch'

brew 'anyenv'

brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

brew 'xcodegen'
brew 'cocoapods'

brew 'postgresql@14'
brew 'mysql'

cask 'iterm2'
cask 'biscuit'
cask 'tableplus'
cask 'transmit'
#cask 'visual-studio-code'

#cask 'adoptopenjdk11'
#cask zulu11
cask zulu17

# cask 'dropbox'
# cask 'google-chrome'
# cask 'karabiner-elements'

brew 'mas'
mas 'Kindle', id: 405399194
mas 'LINE', id: 539883307
mas "RunCat", id: 1429033973
