# Homebrewのリポジトリを追加 (Tap)
# ------------------------------------
tap "heroku/brew"


# コマンドラインツール (Formulae)
# ------------------------------------
brew "anyenv"
brew "awscli"
brew "cocoapods"
brew "eza" # exaの後継
brew "gh"
brew "git"
brew "heroku"
brew "mackup"
brew "mas" # Mac App Store CLI
brew "mysql"
brew "pngquant"
brew "postgresql@14"
brew "trash"
brew "vim"
brew "xcodegen"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"


# GUIアプリケーション (Casks)
# ------------------------------------
cask "biscuit"
cask "iterm2"
cask "tableplus"
cask "transmit"
cask "google-chrome"
cask "slack"


# Mac App Store アプリケーション
# ------------------------------------
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Xcode", id: 497799835

