tap "grishka/grishka"
tap "heroku/brew"
tap "lihaoyun6/tap"
brew "act"
brew "anyenv"
brew "bash"
brew "circleci"
brew "cmake"
brew "cocoapods"
brew "eza"
brew "fastfetch"
brew "fastlane"
brew "gh"
brew "git"
brew "heroku"
brew "htop"
brew "jq"
brew "lefthook"
brew "libpq"
brew "mackup"
brew "mactop"
brew "mas"
brew "mysql"
brew "pipenv"
brew "pipx"
brew "pkgconf"
brew "pngquant"
brew "postgresql@14", restart_service: :changed
brew "python-build"
brew "python@3.12"
brew "ripgrep"
brew "swagger-codegen"
brew "swiftlint"
brew "telnet"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "wget"
brew "xcodegen"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "powershell"
cask "alfred", args: { appdir: "/Applications" }
cask "androidtool"
cask "devtoys"
cask "discord" # 追加
cask "font-meslo-lg-nerd-font" # powerlevel10k推奨フォント
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "iterm2"
cask "logoer"
cask "neardrop"
cask "transmit", args: { appdir: "/Applications" }
cask "xcodes"
cask "zoom" # 追加
mas "CleanMyMac", id: 1339170533
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "FlipClock", id: 1181028777
mas "Gapplin", id: 768053424
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Native SQLite Manager", id: 1416282836
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Slack", id: 803453959
mas "Swift Playground", id: 1496833156
mas "TestFlight", id: 899247664
mas "Transporter", id: 1450874784
mas "Usage", id: 1561788435
mas "Xcode", id: 497799835
