tap "adoptopenjdk/openjdk"
tap "grishka/grishka"
tap "heroku/brew"
tap "lihaoyun6/tap"
brew "act"
brew "anyenv"
brew "awscli"
brew "bash"
brew "circleci"
brew "cmake"
brew "cocoapods"
brew "eza"
brew "fastfetch"
brew "fastlane"
brew "gh"
brew "git"
brew "heroku"
brew "htop"
brew "jq"
brew "lefthook"
brew "libpq"
brew "mackup"
brew "mactop"
brew "mas"
brew "mysql"
brew "openjdk@17"
brew "pipenv"
brew "pipx"
brew "pkgconf"
brew "pngquant"
brew "postgresql@14", restart_service: :changed
brew "python-build"
brew "python@3.12"
brew "ripgrep"
brew "swagger-codegen"
brew "swiftlint"
brew "telnet"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "wget"
brew "xcodegen"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "alfred", args: { appdir: "/Applications" }
cask "androidtool"
cask "biscuit"
cask "devtoys"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "iterm2"
cask "logoer"
cask "neardrop"
cask "tableplus", args: { appdir: "/Applications" }
cask "transmit", args: { appdir: "/Applications" }
cask "xcodes"
mas "CleanMyMac", id: 1339170533
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "FlipClock", id: 1181028777
mas "Gapplin", id: 768053424
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Native SQLite Manager", id: 1416282836
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Slack", id: 803453959
mas "Swift Playground", id: 1496833156
mas "TestFlight", id: 899247664
mas "Transporter", id: 1450874784
mas "Usage", id: 1561788435
mas "Xcode", id: 497799835
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "almenon.arepl"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anysphere.pyright"
vscode "arjun.swagger-viewer"
vscode "askia.askia-qexml-generator-extension"
vscode "aster.vscode-subtitles"
vscode "aws-amplify.aws-amplify-vscode"
vscode "bierner.markdown-mermaid"
vscode "danielthielking.aws-cloudformation-yaml"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "fivethree.vscode-fastlane-snippets"
vscode "formulahendry.vscode-mysql"
vscode "georgewfraser.vscode-javac"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "grapecity.gc-excelviewer"
vscode "hancel.markdown-image"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "jakebathman.mysql-syntax"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "kaiwood.endwise"
vscode "loganarnett.lambda-snippets"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mark-tucker.aws-cli-configure"
vscode "marp-team.marp-vscode"
vscode "mathiasfrohlich.kotlin"
vscode "mebrahtom.plantumlpreviewer"
vscode "mechatroner.rainbow-csv"
vscode "mermade.openapi-lint"
vscode "mhutchie.git-graph"
vscode "mimarec.swagger-doc-viewer"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pepri.subtitles-editor"
vscode "qnsolutions.swaggitor"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "robert-brunhage.flutter-riverpod-snippets"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "simonsiefke.svg-preview"
vscode "starkwang.markdown"
vscode "thomaspink.theme-github"
vscode "thundra.thundra-debugger"
vscode "toba.vsfire"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "vue.volar"
vscode "walkme.java-extension-pack"
vscode "xshrim.txt-syntax"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zoellner.openapi-preview"
